crupib/Atco/STM32/ARMSource/MMBasic-STM32F746/F746_Show_MMBasic/src/stm32_ub_jpg.c
//--------------------------------------------------------------
// File     : stm32_ub_picture.c
// Datum    : 19.03.2013
// Version  : 1.2
// Autor    : UB
// EMail    : mc-4u(@)t-online.de
// Web      : www.mikrocontroller-4u.de
// CPU      : STM32F4
// IDE      : CooCox CoIDE 1.7.0
// Module   : STM32_UB_LCD_ST7783, STM32_UB_FATFS
// Funktion : Bilder per FATFS anzeigen
//
// Formate  : 1. Windows-JPG
//
// Speed    : 1. JPG 240x320 von SD ca. 580 ms
//
// Modified : the 2014-10-05 by Fabrice
//          : Removed all non Jpeg routines
//          : Compile with Keil uVision 5.12
//--------------------------------------------------------------


//--------------------------------------------------------------
// Quelle vom JPG-Encoder :
// http://en.pudn.com/downloads263/sourcecode/
//        embed/detail1210390_en.html
// Version 1.4 (2009.04.21)
//--------------------------------------------------------------


//--------------------------------------------------------------
// Includes
//--------------------------------------------------------------
#include "stm32_ub_jpg.h"


//--------------------------------------------------------------
// interne Funktionen
//--------------------------------------------------------------
unsigned int P_Cal(unsigned char*pc);
int InitTag(void);
void InitTable(void);
int Decode(uint8_t BuffNum);
void GetYUV(short flag);
void StoreBuffer(uint8_t BuffNum);
int DecodeMCUBlock(void);
int HufBlock(PBYTE dchufindex,PBYTE achufindex);
int DecodeElement(void);
void IQtIZzMCUComponent(short flag);
void IQtIZzBlock(short  *s ,short * d,short flag);
void Fast_IDCT(int * block);
PBYTE ReadByte(void);
void Initialize_Fast_IDCT(void);
void idctrow(int * blk);
void idctcol(int * blk);  
//--------------------------------------------------------------
PICTURE_ERR_t P_Picture_Check_BMPHeader(void);
uint16_t P_Picture_2Bytes(uint32_t start);
uint32_t P_Picture_4Bytes(uint32_t start);


//--------------------------------------------------------------
// Globale Variabeln
//--------------------------------------------------------------
FIL myPictureFile;
unsigned char picture_buf[PICTURE_BUF_SIZE];


//--------------------------------------------------------------
// Globale Variabeln für JPG
//--------------------------------------------------------------
const int PICTURE_JPG_ZZ[8][8]={
		{0,1,5,6,14,15,27,28},
		{2,4,7,13,16,26,29,42},
		{3,8,12,17,25,30,41,43},
		{9,11,18,24,37,40,44,53},
		{10,19,23,32,39,45,52,54},
		{20,22,33,38,46,51,55,60},
		{21,34,37,47,50,56,59,61},
		{35,36,48,49,57,58,62,63}
};

const PBYTE PICTURE_JPG_AND[9]={
		0,1,3,7,0xf,0x1f,0x3f,0x7f,0xff
};

PICTURE_JPG_t PICTURE_JPG;
PICTURE_BMP_t PICTURE_BMP;



//--------------------------------------------------------------
// zeichnet ein Windows-JPG-File
// (file muss schon geöffnet sein)
// Return_wert :
//     0 , Bild gezeichnet
//  != 0 , fehler beim zeichnen
//--------------------------------------------------------------
PICTURE_ERR_t UB_Picture_DrawJpg(FIL* fileptr, uint16_t xpos, uint16_t ypos, uint8_t BuffNum)
{
	FATFS_t check_fat;
	uint32_t read_size;
	int funcret;

	PICTURE_JPG.CurX=xpos;
	PICTURE_JPG.CurY=ypos;

	myPictureFile=*fileptr;

    check_fat=UB_Fatfs_ReadBlock(&myPictureFile,picture_buf,PICTURE_BUF_SIZE,&read_size);
	if(check_fat==FATFS_RD_BLOCK_ERR) return 4;

	InitTable();
	if((funcret=InitTag())!=PFUNC_OK) return 5;

	if(BuffNum < 10)
	{
		if(PICTURE_JPG.ImgWidth>LCD_MAXX) return 6;
		if(PICTURE_JPG.ImgHeight>LCD_MAXY) return 7;
	}
	else
	{
		if((PICTURE_JPG.ImgWidth * PICTURE_JPG.ImgHeight * 2) > GFX_MAP_LENGTH) {
			return 11;				// Map too big for the Map buffer
		}
	}

	if((PICTURE_JPG.SampRate_Y_H==0)||(PICTURE_JPG.SampRate_Y_V==0)) return 12;

	funcret=Decode(BuffNum );
	if(funcret!=PFUNC_OK) return 13;

	return 0;
}

//--------------------------------------------------------------
unsigned int P_Cal(unsigned char*pc)
{	
	FATFS_t check_fat;
	uint32_t read_size;
	unsigned short cont=0;
	unsigned long buffer_val=0;
	unsigned long point_val=0;
	unsigned char secoff;
	unsigned short t;
	unsigned char *p;

	p=picture_buf+PICTURE_JPG_BLOCK;
	point_val=(unsigned long)pc;
	buffer_val=(unsigned long)&picture_buf;
	cont=point_val-buffer_val;
	if(cont>=PICTURE_JPG_BLOCK) {
		secoff=cont/PICTURE_JPG_BLOCK;
		while(secoff) {
			for(t=0;t<PICTURE_JPG_BLOCK;t++) {
				picture_buf[t]=p[t];
			}

			check_fat=UB_Fatfs_ReadBlock(&myPictureFile,p,PICTURE_JPG_BLOCK,&read_size);
			if(check_fat==FATFS_RD_BLOCK_ERR) {
				break;
			}

			secoff--;
		}
	}

	return cont-cont%PICTURE_JPG_BLOCK;
}

//--------------------------------------------------------------
int InitTag(void)
{
	PBYTE finish=0;
	PBYTE id;
	short  llength;
	short  i,j,k;
	short  huftab1,huftab2;
	short  huftabindex;
	PBYTE hf_table_index;
	PBYTE qt_table_index;
	PBYTE comnum;
	unsigned char  *lptemp;
	short  colorount;

	PICTURE_JPG.lp=picture_buf+2;
	PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);

	while (!finish)
	{
		id=*(PICTURE_JPG.lp+1);
		PICTURE_JPG.lp+=2;
		PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);
		switch (id)
		{
		case PM_APP0:
			llength=PMAKEWORD(*(PICTURE_JPG.lp+1),*PICTURE_JPG.lp);
			PICTURE_JPG.lp+=llength;
			PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);
			break;
		case PM_DQT:
			llength=PMAKEWORD(*(PICTURE_JPG.lp+1),*PICTURE_JPG.lp);
			qt_table_index=(*(PICTURE_JPG.lp+2))&0x0f;
			lptemp=PICTURE_JPG.lp+3;
			if(llength<80) {
				for(i=0;i<64;i++) {
					PICTURE_JPG.qt_table[qt_table_index][i]=(short)*(lptemp++);
				}
			}
			else {
				for(i=0;i<64;i++) {
					PICTURE_JPG.qt_table[qt_table_index][i]=(short)*(lptemp++);
				}
				qt_table_index=(*(lptemp++))&0x0f;
				for(i=0;i<64;i++) {
					PICTURE_JPG.qt_table[qt_table_index][i]=(short)*(lptemp++);
				}
			}
			PICTURE_JPG.lp+=llength;
			PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);
			break;
		case PM_SOF0:
			llength=PMAKEWORD(*(PICTURE_JPG.lp+1),*PICTURE_JPG.lp);
			PICTURE_JPG.ImgHeight=PMAKEWORD(*(PICTURE_JPG.lp+4),*(PICTURE_JPG.lp+3));
			PICTURE_JPG.ImgWidth=PMAKEWORD(*(PICTURE_JPG.lp+6),*(PICTURE_JPG.lp+5));
			PICTURE_JPG.comp_num=*(PICTURE_JPG.lp+7);
			if((PICTURE_JPG.comp_num!=1)&&(PICTURE_JPG.comp_num!=3))return PFUNC_FORMAT_ERROR;
			if(PICTURE_JPG.comp_num==3)	{
				PICTURE_JPG.comp_index[0]=*(PICTURE_JPG.lp+8);
				PICTURE_JPG.SampRate_Y_H=(*(PICTURE_JPG.lp+9))>>4;
				PICTURE_JPG.SampRate_Y_V=(*(PICTURE_JPG.lp+9))&0x0f;
				PICTURE_JPG.YQtTable=(short *)PICTURE_JPG.qt_table[*(PICTURE_JPG.lp+10)];
				PICTURE_JPG.comp_index[1]=*(PICTURE_JPG.lp+11);
				PICTURE_JPG.SampRate_U_H=(*(PICTURE_JPG.lp+12))>>4;
				PICTURE_JPG.SampRate_U_V=(*(PICTURE_JPG.lp+12))&0x0f;
				PICTURE_JPG.UQtTable=(short *)PICTURE_JPG.qt_table[*(PICTURE_JPG.lp+13)];

				PICTURE_JPG.comp_index[2]=*(PICTURE_JPG.lp+14);
				PICTURE_JPG.SampRate_V_H=(*(PICTURE_JPG.lp+15))>>4;
				PICTURE_JPG.SampRate_V_V=(*(PICTURE_JPG.lp+15))&0x0f;
				PICTURE_JPG.VQtTable=(short *)PICTURE_JPG.qt_table[*(PICTURE_JPG.lp+16)];
			}
			else {
				PICTURE_JPG.comp_index[0]=*(PICTURE_JPG.lp+8);
				PICTURE_JPG.SampRate_Y_H=(*(PICTURE_JPG.lp+9))>>4;
				PICTURE_JPG.SampRate_Y_V=(*(PICTURE_JPG.lp+9))&0x0f;
				PICTURE_JPG.YQtTable=(short *)PICTURE_JPG.qt_table[*(PICTURE_JPG.lp+10)];
				PICTURE_JPG.comp_index[1]=*(PICTURE_JPG.lp+8);
				PICTURE_JPG.SampRate_U_H=1;
				PICTURE_JPG.SampRate_U_V=1;
				PICTURE_JPG.UQtTable=(short *)PICTURE_JPG.qt_table[*(PICTURE_JPG.lp+10)];
				PICTURE_JPG.comp_index[2]=*(PICTURE_JPG.lp+8);
				PICTURE_JPG.SampRate_V_H=1;
				PICTURE_JPG.SampRate_V_V=1;
				PICTURE_JPG.VQtTable=(short *)PICTURE_JPG.qt_table[*(PICTURE_JPG.lp+10)];
			}
			PICTURE_JPG.lp+=llength;
			PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);
			break;
		case PM_DHT:
			llength=PMAKEWORD(*(PICTURE_JPG.lp+1),*PICTURE_JPG.lp);
			if (llength<0xd0) {
				huftab1=(short)(*(PICTURE_JPG.lp+2))>>4;
				huftab2=(short)(*(PICTURE_JPG.lp+2))&0x0f;
				huftabindex=huftab1*2+huftab2;
				lptemp=PICTURE_JPG.lp+3;
				for (i=0; i<16; i++) {
					PICTURE_JPG.code_len_table[huftabindex][i]=(short)(*(lptemp++));
				}
				j=0;
				for (i=0; i<16; i++) {
					if(PICTURE_JPG.code_len_table[huftabindex][i]!=0) {
						k=0;
						while(k<PICTURE_JPG.code_len_table[huftabindex][i]) {
							PICTURE_JPG.code_value_table[huftabindex][k+j]=(short)(*(lptemp++));
							k++;
						}
						j+=k;
					}
				}
				i=0;
				while (PICTURE_JPG.code_len_table[huftabindex][i]==0)i++;
				for (j=0;j<i;j++) {
					PICTURE_JPG.huf_min_value[huftabindex][j]=0;
					PICTURE_JPG.huf_max_value[huftabindex][j]=0;
				}
				PICTURE_JPG.huf_min_value[huftabindex][i]=0;
				PICTURE_JPG.huf_max_value[huftabindex][i]=PICTURE_JPG.code_len_table[huftabindex][i]-1;
				for (j=i+1;j<16;j++) {
					PICTURE_JPG.huf_min_value[huftabindex][j]=(PICTURE_JPG.huf_max_value[huftabindex][j-1]+1)<<1;
					PICTURE_JPG.huf_max_value[huftabindex][j]=PICTURE_JPG.huf_min_value[huftabindex][j]+PICTURE_JPG.code_len_table[huftabindex][j]-1;
				}
				PICTURE_JPG.code_pos_table[huftabindex][0]=0;
				for (j=1;j<16;j++) {
					PICTURE_JPG.code_pos_table[huftabindex][j]=PICTURE_JPG.code_len_table[huftabindex][j-1]+PICTURE_JPG.code_pos_table[huftabindex][j-1];
				}
				PICTURE_JPG.lp+=llength;
				PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);
			}
			else {
				hf_table_index=*(PICTURE_JPG.lp+2);
				PICTURE_JPG.lp+=2;
				PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);
				while (hf_table_index!=0xff) {
					huftab1=(short)hf_table_index>>4;
					huftab2=(short)hf_table_index&0x0f;
					huftabindex=huftab1*2+huftab2;
					lptemp=PICTURE_JPG.lp+1;
					colorount=0;
					for (i=0; i<16; i++) {
						PICTURE_JPG.code_len_table[huftabindex][i]=(short)(*(lptemp++));
						colorount+=PICTURE_JPG.code_len_table[huftabindex][i];
					}
					colorount+=17;
					j=0;
					for (i=0; i<16; i++) {
						if(PICTURE_JPG.code_len_table[huftabindex][i]!=0) {
							k=0;
							while(k<PICTURE_JPG.code_len_table[huftabindex][i]) {
								PICTURE_JPG.code_value_table[huftabindex][k+j]=(short)(*(lptemp++));
								k++;
							}
							j+=k;
						}
					}
					i=0;
					while (PICTURE_JPG.code_len_table[huftabindex][i]==0)i++;
					for (j=0;j<i;j++) {
						PICTURE_JPG.huf_min_value[huftabindex][j]=0;
						PICTURE_JPG.huf_max_value[huftabindex][j]=0;
					}
					PICTURE_JPG.huf_min_value[huftabindex][i]=0;
					PICTURE_JPG.huf_max_value[huftabindex][i]=PICTURE_JPG.code_len_table[huftabindex][i]-1;
					for (j=i+1;j<16;j++) {
						PICTURE_JPG.huf_min_value[huftabindex][j]=(PICTURE_JPG.huf_max_value[huftabindex][j-1]+1)<<1;
						PICTURE_JPG.huf_max_value[huftabindex][j]=PICTURE_JPG.huf_min_value[huftabindex][j]+PICTURE_JPG.code_len_table[huftabindex][j]-1;
					}
					PICTURE_JPG.code_pos_table[huftabindex][0]=0;
					for (j=1;j<16;j++) {
						PICTURE_JPG.code_pos_table[huftabindex][j]=PICTURE_JPG.code_len_table[huftabindex][j-1]+PICTURE_JPG.code_pos_table[huftabindex][j-1];
					}
					PICTURE_JPG.lp+=colorount;
					PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);
					hf_table_index=*PICTURE_JPG.lp;
				}
			}
			break;
		case PM_DRI:
			llength=PMAKEWORD(*(PICTURE_JPG.lp+1),*PICTURE_JPG.lp);
			PICTURE_JPG.restart=PMAKEWORD(*(PICTURE_JPG.lp+3),*(PICTURE_JPG.lp+2));
			PICTURE_JPG.lp+=llength;
			PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);
			break;
		case PM_SOS:
			llength=PMAKEWORD(*(PICTURE_JPG.lp+1),*PICTURE_JPG.lp);
			comnum=*(PICTURE_JPG.lp+2);
			if(comnum!=PICTURE_JPG.comp_num) return PFUNC_FORMAT_ERROR;
			lptemp=PICTURE_JPG.lp+3;
			for (i=0;i<PICTURE_JPG.comp_num;i++) {
				if(*lptemp==PICTURE_JPG.comp_index[0]) {
					PICTURE_JPG.YDcIndex=(*(lptemp+1))>>4;
					PICTURE_JPG.YAcIndex=((*(lptemp+1))&0x0f)+2;
				}
				else {
					PICTURE_JPG.UVDcIndex=(*(lptemp+1))>>4;
					PICTURE_JPG.UVAcIndex=((*(lptemp+1))&0x0f)+2;
				}
				lptemp+=2;
			}
			PICTURE_JPG.lp+=llength;
			PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);
			finish=1;
			break;
		case PM_EOI:
			return PFUNC_FORMAT_ERROR;
			//      break;
		default:
			if ((id&0xf0)!=0xd0) {
				llength=PMAKEWORD(*(PICTURE_JPG.lp+1),*PICTURE_JPG.lp);
				PICTURE_JPG.lp+=llength;
				PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);
			}
			else {
				PICTURE_JPG.lp+=2;
			}
			break;
		}
	}
	return PFUNC_OK;
}


//--------------------------------------------------------------
void InitTable(void)
{
	short i,j;

	PICTURE_JPG.sizei=0;
	PICTURE_JPG.sizej=0;
	PICTURE_JPG.ImgWidth=0;
	PICTURE_JPG.ImgHeight=0;
	PICTURE_JPG.rrun=0;
	PICTURE_JPG.vvalue=0;
	PICTURE_JPG.BitPos=0;
	PICTURE_JPG.CurByte=0;
	PICTURE_JPG.IntervalFlag=0;
	PICTURE_JPG.restart=0;
	for(i=0;i<3;i++) {
		for(j=0;j<64;j++) {
			PICTURE_JPG.qt_table[i][j]=0;
		}
	}
	PICTURE_JPG.comp_num=0;
	PICTURE_JPG.HufTabIndex=0;
	for(i=0;i<3;i++) {
		PICTURE_JPG.comp_index[i]=0;
	}
	for(i=0;i<4;i++) {
		for(j=0;j<16;j++) {
			PICTURE_JPG.code_len_table[i][j]=0;
			PICTURE_JPG.code_pos_table[i][j]=0;
			PICTURE_JPG.huf_max_value[i][j]=0;
			PICTURE_JPG.huf_min_value[i][j]=0;
		}
	}
	for(i=0;i<4;i++) {
		for(j=0;j<256;j++) {
			PICTURE_JPG.code_value_table[i][j]=0;
		}
	}

	for(i=0;i<10*64;i++) {
		PICTURE_JPG.MCUBuffer[i]=0;
		PICTURE_JPG.QtZzMCUBuffer[i]=0;
	}
	for(i=0;i<64;i++) {
		PICTURE_JPG.Y[i]=0;
		PICTURE_JPG.U[i]=0;
		PICTURE_JPG.V[i]=0;
		PICTURE_JPG.BlockBuffer[i]=0;
	}
	PICTURE_JPG.ycoef=0;
	PICTURE_JPG.ucoef=0;
	PICTURE_JPG.vcoef=0;
}


//--------------------------------------------------------------
int Decode(uint8_t BuffNum)
{
	int funcret;

	PICTURE_JPG.Y_in_MCU=PICTURE_JPG.SampRate_Y_H*PICTURE_JPG.SampRate_Y_V;
	PICTURE_JPG.U_in_MCU=PICTURE_JPG.SampRate_U_H*PICTURE_JPG.SampRate_U_V;
	PICTURE_JPG.V_in_MCU=PICTURE_JPG.SampRate_V_H*PICTURE_JPG.SampRate_V_V;
	PICTURE_JPG.H_YtoU=PICTURE_JPG.SampRate_Y_H/PICTURE_JPG.SampRate_U_H;
	PICTURE_JPG.V_YtoU=PICTURE_JPG.SampRate_Y_V/PICTURE_JPG.SampRate_U_V;
	PICTURE_JPG.H_YtoV=PICTURE_JPG.SampRate_Y_H/PICTURE_JPG.SampRate_V_H;
	PICTURE_JPG.V_YtoV=PICTURE_JPG.SampRate_Y_V/PICTURE_JPG.SampRate_V_V;
	Initialize_Fast_IDCT();
	while((funcret=DecodeMCUBlock())==PFUNC_OK) {
		PICTURE_JPG.interval++;
		if((PICTURE_JPG.restart)&&(PICTURE_JPG.interval % PICTURE_JPG.restart==0)) {
			PICTURE_JPG.IntervalFlag=1;
		}
		else {
			PICTURE_JPG.IntervalFlag=0;
		}
		IQtIZzMCUComponent(0);
		IQtIZzMCUComponent(1);
		IQtIZzMCUComponent(2);
		GetYUV(0);
		GetYUV(1);
		GetYUV(2);
		StoreBuffer(BuffNum );
		PICTURE_JPG.sizej+=PICTURE_JPG.SampRate_Y_H*8;
		if(PICTURE_JPG.sizej>=PICTURE_JPG.ImgWidth) {
			PICTURE_JPG.sizej=0;
			PICTURE_JPG.sizei+=PICTURE_JPG.SampRate_Y_V*8;
		}
		if ((PICTURE_JPG.sizej==0)&&(PICTURE_JPG.sizei>=PICTURE_JPG.ImgHeight)) break;
	}
	return funcret;
}

//--------------------------------------------------------------
void GetYUV(short flag)
{
	short	H,VV;
	short	i,j,k,h;
	short *buf;
	short *pQtZzMCU;

