crupib/Atco/STM32/ARMSource/MMBasic-STM32F746/F746_Show_MMBasic/src/stm32_ub_jpg.c
	switch(flag)
	{
	case 0:
		H=PICTURE_JPG.SampRate_Y_H;
		VV=PICTURE_JPG.SampRate_Y_V;
		buf=PICTURE_JPG.Y;
		pQtZzMCU=PICTURE_JPG.QtZzMCUBuffer;
		break;
	case 1:
		H=PICTURE_JPG.SampRate_U_H;
		VV=PICTURE_JPG.SampRate_U_V;
		buf=PICTURE_JPG.U;
		pQtZzMCU=PICTURE_JPG.QtZzMCUBuffer+PICTURE_JPG.Y_in_MCU*64;
		break;
	case 2:
		H=PICTURE_JPG.SampRate_V_H;
		VV=PICTURE_JPG.SampRate_V_V;
		buf=PICTURE_JPG.V;
		pQtZzMCU=PICTURE_JPG.QtZzMCUBuffer+(PICTURE_JPG.Y_in_MCU+PICTURE_JPG.U_in_MCU)*64;
		break;
	}
	for (i=0;i<VV;i++) {
		for(j=0;j<H;j++) {
			for(k=0;k<8;k++) {
				for(h=0;h<8;h++) {
					buf[(i*8+k)*PICTURE_JPG.SampRate_Y_H*8+j*8+h]=*pQtZzMCU++;
				}
			}
		}
	}
}

//--------------------------------------------------------------
void StoreBuffer(uint8_t BuffNum)
{
	short i=0,j=0;
	unsigned char R,G,B;
	int y,u,v,rr,gg,bb;
	long color;

	if(BuffNum == 10){
	Map_Width = PICTURE_JPG.ImgWidth;
	Map_Height= PICTURE_JPG.ImgHeight;
	}

	for(i=0;i<PICTURE_JPG.SampRate_Y_V*8;i++) {
		if((PICTURE_JPG.sizei+i)<PICTURE_JPG.ImgHeight) {
			for(j=0;j<PICTURE_JPG.SampRate_Y_H*8;j++) {
				if((PICTURE_JPG.sizej+j)<PICTURE_JPG.ImgWidth) {
					y=PICTURE_JPG.Y[i*8*PICTURE_JPG.SampRate_Y_H+j];
					u=PICTURE_JPG.U[(i/PICTURE_JPG.V_YtoU)*8*PICTURE_JPG.SampRate_Y_H+j/PICTURE_JPG.H_YtoU];
					v=PICTURE_JPG.V[(i/PICTURE_JPG.V_YtoV)*8*PICTURE_JPG.SampRate_Y_H+j/PICTURE_JPG.H_YtoV];
					rr=((y<<8)+18*u+367*v)>>8;
					gg=((y<<8)-159*u-220*v)>>8;
					bb=((y<<8)+411*u-29*v)>>8;
					R=(unsigned char)rr;
					G=(unsigned char)gg;
					B=(unsigned char)bb;
					if (rr&0xffffff00) {
						if (rr>255) {
							R=255;
						}
						else {
							if (rr<0) R=0;
						}
					}
					if (gg&0xffffff00) {
						if (gg>255) {
							G=255;
						}
						else {
							if (gg<0) G=0;
						}
					}
					if (bb&0xffffff00) {
						if (bb>255) {
							B=255;
						}
						else {
							if (bb<0) B=0;
						}
					}
					color=R>>3;
					color=color<<6;
					color |=(G>>2);
					color=color<<5;
					color |=(B>>3);

					// Pixel zeichnen
					if(BuffNum <=2) {
						// Normal buffer
						GFX_SetPixel(PICTURE_JPG.sizej+j+PICTURE_JPG.CurX , PICTURE_JPG.sizei+i+PICTURE_JPG.CurY , color , BuffNum);
					} else {
						// nicht ok ... eine ideen Uwe ? (todo: fix this)
						MapMemory[(Map_Width * i) + j] = color;
					}
				}
				else  break;
			}
		}
		else break;
	}
}

//--------------------------------------------------------------
int DecodeMCUBlock(void)
{
	short *lpMCUBuffer;
	short i,j;
	int funcret;

	if (PICTURE_JPG.IntervalFlag==1) {
		PICTURE_JPG.lp+=2;
		PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);
		PICTURE_JPG.ycoef=0;
		PICTURE_JPG.ucoef=0;
		PICTURE_JPG.vcoef=0;
		PICTURE_JPG.BitPos=0;
		PICTURE_JPG.CurByte=0;
	}
	switch(PICTURE_JPG.comp_num)
	{
	case 3:
		lpMCUBuffer=PICTURE_JPG.MCUBuffer;
		for (i=0;i<PICTURE_JPG.SampRate_Y_H*PICTURE_JPG.SampRate_Y_V;i++) {
			funcret=HufBlock(PICTURE_JPG.YDcIndex,PICTURE_JPG.YAcIndex);
			if (funcret!=PFUNC_OK) return funcret;
			PICTURE_JPG.BlockBuffer[0]=PICTURE_JPG.BlockBuffer[0]+PICTURE_JPG.ycoef;
			PICTURE_JPG.ycoef=PICTURE_JPG.BlockBuffer[0];
			for (j=0;j<64;j++) {
				*lpMCUBuffer++=PICTURE_JPG.BlockBuffer[j];
			}
		}
		for (i=0;i<PICTURE_JPG.SampRate_U_H*PICTURE_JPG.SampRate_U_V;i++) {
			funcret=HufBlock(PICTURE_JPG.UVDcIndex,PICTURE_JPG.UVAcIndex);
			if (funcret!=PFUNC_OK) return funcret;
			PICTURE_JPG.BlockBuffer[0]=PICTURE_JPG.BlockBuffer[0]+PICTURE_JPG.ucoef;
			PICTURE_JPG.ucoef=PICTURE_JPG.BlockBuffer[0];
			for (j=0;j<64;j++) {
				*lpMCUBuffer++=PICTURE_JPG.BlockBuffer[j];
			}
		}
		for (i=0;i<PICTURE_JPG.SampRate_V_H*PICTURE_JPG.SampRate_V_V;i++) {
			funcret=HufBlock(PICTURE_JPG.UVDcIndex,PICTURE_JPG.UVAcIndex);
			if (funcret!=PFUNC_OK) return funcret;
			PICTURE_JPG.BlockBuffer[0]=PICTURE_JPG.BlockBuffer[0]+PICTURE_JPG.vcoef;
			PICTURE_JPG.vcoef=PICTURE_JPG.BlockBuffer[0];
			for (j=0;j<64;j++) {
				*lpMCUBuffer++=PICTURE_JPG.BlockBuffer[j];
			}
		}
		break;
	case 1:
		lpMCUBuffer=PICTURE_JPG.MCUBuffer;
		funcret=HufBlock(PICTURE_JPG.YDcIndex,PICTURE_JPG.YAcIndex);
		if (funcret!=PFUNC_OK) return funcret;
		PICTURE_JPG.BlockBuffer[0]=PICTURE_JPG.BlockBuffer[0]+PICTURE_JPG.ycoef;
		PICTURE_JPG.ycoef=PICTURE_JPG.BlockBuffer[0];
		for (j=0;j<64;j++) {
			*lpMCUBuffer++=PICTURE_JPG.BlockBuffer[j];
		}
		for (i=0;i<128;i++) {
			*lpMCUBuffer++=0;
		}
		break;
	default:
		return PFUNC_FORMAT_ERROR;
	}
	return PFUNC_OK;
}

//--------------------------------------------------------------
int HufBlock(PBYTE dchufindex,PBYTE achufindex)
{
	short count=0;
	short i;
	int funcret;

	PICTURE_JPG.HufTabIndex=dchufindex;
	funcret=DecodeElement();
	if(funcret!=PFUNC_OK) return funcret;

	PICTURE_JPG.BlockBuffer[count++]=PICTURE_JPG.vvalue;
	PICTURE_JPG.HufTabIndex=achufindex;
	while (count<64) {
		funcret=DecodeElement();
		if(funcret!=PFUNC_OK) return funcret;
		if ((PICTURE_JPG.rrun==0)&&(PICTURE_JPG.vvalue==0)) {
			for (i=count;i<64;i++) {
				PICTURE_JPG.BlockBuffer[i]=0;
			}
			count=64;
		}
		else {
			for (i=0;i<PICTURE_JPG.rrun;i++) {
				PICTURE_JPG.BlockBuffer[count++]=0;
			}
			PICTURE_JPG.BlockBuffer[count++]=PICTURE_JPG.vvalue;
		}
	}
	return PFUNC_OK;
}

//--------------------------------------------------------------
int DecodeElement(void)
{
	int thiscode,tempcode;
	unsigned short temp,valueex;
	short codelen;
	PBYTE hufexbyte,runsize,tempsize,sign;
	PBYTE newbyte,lastbyte;

	if(PICTURE_JPG.BitPos>=1) {
		PICTURE_JPG.BitPos--;
		thiscode=(PBYTE)PICTURE_JPG.CurByte>>PICTURE_JPG.BitPos;
		PICTURE_JPG.CurByte=PICTURE_JPG.CurByte&PICTURE_JPG_AND[PICTURE_JPG.BitPos];
	}
	else {
		lastbyte=ReadByte();
		PICTURE_JPG.BitPos--;
		newbyte=PICTURE_JPG.CurByte&PICTURE_JPG_AND[PICTURE_JPG.BitPos];
		thiscode=lastbyte>>7;
		PICTURE_JPG.CurByte=newbyte;
	}
	codelen=1;

	while ((thiscode<PICTURE_JPG.huf_min_value[PICTURE_JPG.HufTabIndex][codelen-1])||
			(PICTURE_JPG.code_len_table[PICTURE_JPG.HufTabIndex][codelen-1]==0)||
			(thiscode>PICTURE_JPG.huf_max_value[PICTURE_JPG.HufTabIndex][codelen-1])) {
		if(PICTURE_JPG.BitPos>=1) {
			PICTURE_JPG.BitPos--;
			tempcode=(PBYTE)PICTURE_JPG.CurByte>>PICTURE_JPG.BitPos;
			PICTURE_JPG.CurByte=PICTURE_JPG.CurByte&PICTURE_JPG_AND[PICTURE_JPG.BitPos];
		}
		else {
			lastbyte=ReadByte();
			PICTURE_JPG.BitPos--;
			newbyte=PICTURE_JPG.CurByte&PICTURE_JPG_AND[PICTURE_JPG.BitPos];
			tempcode=(PBYTE)lastbyte>>7;
			PICTURE_JPG.CurByte=newbyte;
		}
		thiscode=(thiscode<<1)+tempcode;
		codelen++;
		if(codelen>16)return PFUNC_FORMAT_ERROR;
	}
	temp=thiscode-PICTURE_JPG.huf_min_value[PICTURE_JPG.HufTabIndex][codelen-1]+PICTURE_JPG.code_pos_table[PICTURE_JPG.HufTabIndex][codelen-1];
	hufexbyte=(PBYTE)PICTURE_JPG.code_value_table[PICTURE_JPG.HufTabIndex][temp];
	PICTURE_JPG.rrun=(short)(hufexbyte>>4);
	runsize=hufexbyte&0x0f;
	if(runsize==0) {
		PICTURE_JPG.vvalue=0;
		return PFUNC_OK;
	}
	tempsize=runsize;
	if(PICTURE_JPG.BitPos>=runsize) {
		PICTURE_JPG.BitPos-=runsize;
		valueex=(PBYTE)PICTURE_JPG.CurByte>>PICTURE_JPG.BitPos;
		PICTURE_JPG.CurByte=PICTURE_JPG.CurByte&PICTURE_JPG_AND[PICTURE_JPG.BitPos];
	}
	else {
		valueex=PICTURE_JPG.CurByte;
		tempsize-=PICTURE_JPG.BitPos;
		while(tempsize>8) {
			lastbyte=ReadByte();
			valueex=(valueex<<8)+(PBYTE)lastbyte;
			tempsize-=8;
		}
		lastbyte=ReadByte();
		PICTURE_JPG.BitPos-=tempsize;
		valueex=(valueex<<tempsize)+(lastbyte>>PICTURE_JPG.BitPos);
		PICTURE_JPG.CurByte=lastbyte&PICTURE_JPG_AND[PICTURE_JPG.BitPos];
	}
	sign=valueex>>(runsize-1);
	if(sign) {
		PICTURE_JPG.vvalue=valueex;
	}
	else {
		valueex=valueex^0xffff;
		temp=0xffff<<runsize;
		PICTURE_JPG.vvalue=-(short)(valueex^temp);
	}
	return PFUNC_OK;
}

//--------------------------------------------------------------
void IQtIZzMCUComponent(short flag)
{
	short H,VV;
	short i,j;
	short *pQtZzMCUBuffer;
	short  *pMCUBuffer;

	switch(flag){
	case 0:
		H=PICTURE_JPG.SampRate_Y_H;
		VV=PICTURE_JPG.SampRate_Y_V;
		pMCUBuffer=PICTURE_JPG.MCUBuffer;
		pQtZzMCUBuffer=PICTURE_JPG.QtZzMCUBuffer;
		break;
	case 1:
		H=PICTURE_JPG.SampRate_U_H;
		VV=PICTURE_JPG.SampRate_U_V;
		pMCUBuffer=PICTURE_JPG.MCUBuffer+PICTURE_JPG.Y_in_MCU*64;
		pQtZzMCUBuffer=PICTURE_JPG.QtZzMCUBuffer+PICTURE_JPG.Y_in_MCU*64;
		break;
	case 2:
		H=PICTURE_JPG.SampRate_V_H;
		VV=PICTURE_JPG.SampRate_V_V;
		pMCUBuffer=PICTURE_JPG.MCUBuffer+(PICTURE_JPG.Y_in_MCU+PICTURE_JPG.U_in_MCU)*64;
		pQtZzMCUBuffer=PICTURE_JPG.QtZzMCUBuffer+(PICTURE_JPG.Y_in_MCU+PICTURE_JPG.U_in_MCU)*64;
		break;
	}
	for(i=0;i<VV;i++) {
		for (j=0;j<H;j++) {
			IQtIZzBlock(pMCUBuffer+(i*H+j)*64,pQtZzMCUBuffer+(i*H+j)*64,flag);
		}
	}
}

//--------------------------------------------------------------
void IQtIZzBlock(short  *s ,short * d,short flag)
{
	short i,j;
	short tag;
	short *pQt;
	int buffer2[8][8];
	int *buffer1;
	short offset;

