crupib/Atco/STM32/ARMSource/MMBasic-STM32F746/F746_Show_MMBasic/src/stm32_ub_jpg.c
	switch(flag)
	{
	case 0:
		pQt=PICTURE_JPG.YQtTable;
		offset=128;
		break;
	case 1:
		pQt=PICTURE_JPG.UQtTable;
		offset=0;
		break;
	case 2:
		pQt=PICTURE_JPG.VQtTable;
		offset=0;
		break;
	}

	for(i=0;i<8;i++) {
		for(j=0;j<8;j++) {
			tag=PICTURE_JPG_ZZ[i][j];
			buffer2[i][j]=(int)s[tag]*(int)pQt[tag];
		}
	}

	buffer1=(int *)buffer2;
	Fast_IDCT(buffer1);
	for(i=0;i<8;i++) {
		for(j=0;j<8;j++) {
			d[i*8+j]=buffer2[i][j]+offset;
		}
	}
}

//--------------------------------------------------------------
void Fast_IDCT(int * block)
{
	short i;

	for (i=0; i<8; i++)idctrow(block+8*i);
	for (i=0; i<8; i++)idctcol(block+i);
}

//--------------------------------------------------------------
PBYTE ReadByte(void)
{
	PBYTE  i;

	i=*(PICTURE_JPG.lp++);
	PICTURE_JPG.lp-=P_Cal(PICTURE_JPG.lp);
	if(i==0xff)PICTURE_JPG.lp++;
	PICTURE_JPG.BitPos=8;
	PICTURE_JPG.CurByte=i;
	return i;
}

//--------------------------------------------------------------
void Initialize_Fast_IDCT(void)
{
	short i;

	PICTURE_JPG.iclp = PICTURE_JPG.iclip+512;
	for (i= -512; i<512; i++) {
		PICTURE_JPG.iclp[i] = (i<-256) ? -256 : ((i>255) ? 255 : i);
	}
}

//--------------------------------------------------------------
void idctrow(int * blk)
{
	int x0, x1, x2, x3, x4, x5, x6, x7, x8;

	if (!((x1 = blk[4]<<11) | (x2 = blk[6]) | (x3 = blk[2]) |
			(x4 = blk[1]) | (x5 = blk[7]) | (x6 = blk[5]) | (x7 = blk[3]))) {
		blk[0]=blk[1]=blk[2]=blk[3]=blk[4]=blk[5]=blk[6]=blk[7]=blk[0]<<3;
		return;
	}

	x0 = (blk[0]<<11) + 128;

	x8 = PW7*(x4+x5);
	x4 = x8 + (PW1-PW7)*x4;
	x5 = x8 - (PW1+PW7)*x5;
	x8 = PW3*(x6+x7);
	x6 = x8 - (PW3-PW5)*x6;
	x7 = x8 - (PW3+PW5)*x7;

	x8 = x0 + x1;
	x0 -= x1;
	x1 = PW6*(x3+x2);
	x2 = x1 - (PW2+PW6)*x2;
	x3 = x1 + (PW2-PW6)*x3;
	x1 = x4 + x6;
	x4 -= x6;
	x6 = x5 + x7;
	x5 -= x7;

	x7 = x8 + x3;
	x8 -= x3;
	x3 = x0 + x2;
	x0 -= x2;
	x2 = (181*(x4+x5)+128)>>8;
	x4 = (181*(x4-x5)+128)>>8;

	blk[0] = (x7+x1)>>8;
	blk[1] = (x3+x2)>>8;
	blk[2] = (x0+x4)>>8;
	blk[3] = (x8+x6)>>8;
	blk[4] = (x8-x6)>>8;
	blk[5] = (x0-x4)>>8;
	blk[6] = (x3-x2)>>8;
	blk[7] = (x7-x1)>>8;
}

//--------------------------------------------------------------
void idctcol(int * blk)
{
	int x0, x1, x2, x3, x4, x5, x6, x7, x8;

	if (!((x1 = (blk[8*4]<<8)) | (x2 = blk[8*6]) | (x3 = blk[8*2]) |
			(x4 = blk[8*1]) | (x5 = blk[8*7]) | (x6 = blk[8*5]) | (x7 = blk[8*3]))) {
		blk[8*0]=blk[8*1]=blk[8*2]=blk[8*3]=blk[8*4]=blk[8*5]=blk[8*6]=blk[8*7]=PICTURE_JPG.iclp[(blk[8*0]+32)>>6];
		return;
	}
	x0 = (blk[8*0]<<8) + 8192;

	x8 = PW7*(x4+x5) + 4;
	x4 = (x8+(PW1-PW7)*x4)>>3;
	x5 = (x8-(PW1+PW7)*x5)>>3;
	x8 = PW3*(x6+x7) + 4;
	x6 = (x8-(PW3-PW5)*x6)>>3;
	x7 = (x8-(PW3+PW5)*x7)>>3;

	x8 = x0 + x1;
	x0 -= x1;
	x1 = PW6*(x3+x2) + 4;
	x2 = (x1-(PW2+PW6)*x2)>>3;
	x3 = (x1+(PW2-PW6)*x3)>>3;
	x1 = x4 + x6;
	x4 -= x6;
	x6 = x5 + x7;
	x5 -= x7;

	x7 = x8 + x3;
	x8 -= x3;
	x3 = x0 + x2;
	x0 -= x2;
	x2 = (181*(x4+x5)+128)>>8;
	x4 = (181*(x4-x5)+128)>>8;

	blk[8*0] = PICTURE_JPG.iclp[(x7+x1)>>14];
	blk[8*1] = PICTURE_JPG.iclp[(x3+x2)>>14];
	blk[8*2] = PICTURE_JPG.iclp[(x0+x4)>>14];
	blk[8*3] = PICTURE_JPG.iclp[(x8+x6)>>14];
	blk[8*4] = PICTURE_JPG.iclp[(x8-x6)>>14];
	blk[8*5] = PICTURE_JPG.iclp[(x0-x4)>>14];
	blk[8*6] = PICTURE_JPG.iclp[(x3-x2)>>14];
	blk[8*7] = PICTURE_JPG.iclp[(x7-x1)>>14];
}



//--------------------------------------------------------------
// zeichnet ein Windows-BMP-File
// (file muss schon geöffnet sein)
// PORTRAIT  : linke obere Ecke = xpos,ypos
// LANDSCAPE : linke untere Ecke = xpos,ypos
// Return_wert :
//     0 , Bild gezeichnet
//  != 0 , fehler beim zeichnen
//--------------------------------------------------------------
PICTURE_ERR_t UB_Picture_DrawBmp(FIL *fileptr, uint16_t xpos, uint16_t ypos, uint8_t BuffNum)
{
  PICTURE_ERR_t ret_wert=0;
  FATFS_t check_fat;
  uint32_t read_size;
  uint8_t blue, green, red;
  uint16_t xn=0;
  uint16_t yn=0;
  uint16_t color;
  uint8_t picture_ready=0;

  myPictureFile=*fileptr;

  // BMP-Header prüfen
  ret_wert=P_Picture_Check_BMPHeader();

  if(ret_wert==PICTURE_OK)  {
    do {

      // Byte für "Blau" lesen
      blue=(picture_buf[PICTURE_BMP.akt_ptr]&0xF8); // 5bit
      PICTURE_BMP.akt_ptr++;
      if(PICTURE_BMP.akt_ptr>=PICTURE_BMP.bytes_in_buf) {
        // Puffer leer -> File nachladen
        check_fat=UB_Fatfs_ReadBlock(&myPictureFile,picture_buf,PICTURE_BUF_SIZE,&read_size);
        PICTURE_BMP.bytes_in_buf=read_size;
        PICTURE_BMP.akt_ptr=0;
        if(check_fat==FATFS_RD_BLOCK_ERR) picture_ready=1;
      }

      // Byte für "Grün" lesen
      green=(picture_buf[PICTURE_BMP.akt_ptr]&0xFC); // 6bit
      PICTURE_BMP.akt_ptr++;
      if(PICTURE_BMP.akt_ptr>=PICTURE_BMP.bytes_in_buf) {
        // Puffer leer -> File nachladen
        check_fat=UB_Fatfs_ReadBlock(&myPictureFile,picture_buf,PICTURE_BUF_SIZE,&read_size);
        PICTURE_BMP.bytes_in_buf=read_size;
        PICTURE_BMP.akt_ptr=0;
        if(check_fat==FATFS_RD_BLOCK_ERR) picture_ready=1;
      }

      // Byte für "Rot" lesen
      red=(picture_buf[PICTURE_BMP.akt_ptr]&0xF8); // 5bit
      PICTURE_BMP.akt_ptr++;
      if(PICTURE_BMP.akt_ptr>=PICTURE_BMP.bytes_in_buf) {
        // Puffer leer -> File nachladen
        check_fat=UB_Fatfs_ReadBlock(&myPictureFile,picture_buf,PICTURE_BUF_SIZE,&read_size);
        PICTURE_BMP.bytes_in_buf=read_size;
        PICTURE_BMP.akt_ptr=0;
        if(check_fat==FATFS_RD_BLOCK_ERR) picture_ready=1;
      }

      // Pixel auf Display zeichnen
      color = ((red<<8) | (green<<3) | (blue>>3));
      GFX_SetPixel(xn+xpos , PICTURE_BMP.height-yn-1+ypos , color , BuffNum);

      xn++;
      if(xn>=PICTURE_BMP.width) {
        // Neue Zeile
        xn=0;
        yn++;

        // Check ob BMP fertig gezeichnet
        if(yn>=PICTURE_BMP.height) {
          picture_ready=2;
        }
        else {
          PICTURE_BMP.akt_ptr+=PICTURE_BMP.spacer;
        }
      }
    }while(picture_ready==0);

    if(picture_ready==1) ret_wert=PICTURE_FILE_ERR;
  }

  return ret_wert;
}

PICTURE_ERR_t P_Picture_Check_BMPHeader(void)
{
  PICTURE_ERR_t ret_wert=PICTURE_FILE_ERR;
  FATFS_t check_fat;
  uint32_t read_size;
  uint32_t temp;

  check_fat=UB_Fatfs_ReadBlock(&myPictureFile,picture_buf,PICTURE_BUF_SIZE,&read_size);
  if((check_fat==FATFS_OK) || (check_fat==FATFS_EOF)) {
    // Filesize bei BMP muss > 54 Bytes sein
    if(read_size<54) return(PICTURE_SIZE_ERR);
    // Check auf BMP-ID : 'BM'
    if((picture_buf[0]!='B') || (picture_buf[1]!='M')) return(PICTURE_ID_ERR);
    PICTURE_BMP.offset=P_Picture_4Bytes(10);
    // Check auf Headersize : 40d
    temp=P_Picture_4Bytes(14);
    if(temp!=40) return(PICTURE_HEAD_ERR);
    // Check auf Breite und Hoehe
    PICTURE_BMP.width=P_Picture_4Bytes(18);
    PICTURE_BMP.height=P_Picture_4Bytes(22);
    if(PICTURE_BMP.width>LCD_MAXX) return(PICTURE_WIDTH_ERR);
    if(PICTURE_BMP.height>LCD_MAXY) return(PICTURE_HEIGHT_ERR);
    // Check auf BitPerPixel : 24d
    PICTURE_BMP.bpp=P_Picture_2Bytes(28);
    if(PICTURE_BMP.bpp!=24) return(PICTURE_BPP_ERR);
    // Check auf Kompression : keine
    PICTURE_BMP.compr=P_Picture_4Bytes(30);
    if(PICTURE_BMP.compr!=0) return(PICTURE_COMPR_ERR);
    // Variabeln setzen
    PICTURE_BMP.spacer=(PICTURE_BMP.width & 0x03);
    PICTURE_BMP.bytes_in_buf=read_size;
    PICTURE_BMP.akt_ptr=PICTURE_BMP.offset;
    ret_wert=PICTURE_OK;
  }
  else {
    ret_wert=PICTURE_FILE_ERR;
  }

  return(ret_wert);
}

uint32_t P_Picture_4Bytes(uint32_t start)
{
  uint32_t ret_wert=0;

  ret_wert|=(picture_buf[start]);
  ret_wert|=(picture_buf[start+1]<<8);
  ret_wert|=(picture_buf[start+2]<<16);
  ret_wert|=(picture_buf[start+3]<<24);

  return(ret_wert);
}

uint16_t P_Picture_2Bytes(uint32_t start)
{
  uint16_t ret_wert=0;

  ret_wert|=(picture_buf[start]);
  ret_wert|=(picture_buf[start+1]<<8);

  return(ret_wert);
}
